cfd_interfaces/openfoam/examples/rectangular_wing/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (-5.0  -5.0 -10.0)
    ( 10.0 -5.0 -10.0)
    ( 10.0  5.0 -10.0)
    (-5.0   5.0 -10.0)
    (-5.0  -5.0  10.0)
    ( 10.0 -5.0  10.0)
    ( 10.0  5.0  10.0)
    (-5.0   5.0  10.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (53 35 70) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ( (0 4 7 3) );
    }

    outlet
    {
        type patch;
        faces ( (1 2 6 5) );
    }

    sides
    {
        type patch;
        faces 
        (
            (0 1 5 4)
            (0 3 2 1)
            (2 3 7 6)
            (4 5 6 7)
        );
    }
);
