cfd_interfaces/openfoam/examples/rectangular_wing/0.org/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type    zeroGradient;
    }

    sides
    {
        type    zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
}
