cfd_interfaces/openfoam/examples/rectangular_wing/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver           GAMG;
        smoother         DICGaussSeidel;
        tolerance        1e-6;
        relTol           0.01;
    }

    pFinal
    {
        $p;
        relTol          0.001;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.001;
    }

    UFinal
    {
        $U;
        relTol 0.0001;
    }
}

PIMPLE
{
    nCorrectors              2;
    nNonOrthogonalCorrectors 0;
}
